// Режим современного кода. 
// Т.е. использование и применение элементов актуальной, современной версии.
//Игноирование предупреждения.
/* jshint -W030 */
"use strict";

// confirm.
// Вызов всплывающего, модального, окна с указанным вопросом. 
// Варианты "Ок" и "Отмена".
// const result = confirm("Are you okay?");

// prompt
// Вызов всплывающего, модального, окна с полем 
// ввода ответа на поставленный вопрос.
// Параметр №1. Вопрос в кавычках
// Параметр №2. Ответ по умолчанию.
// Значения Строковые. 
// Вся вводимая, пользователем информация, по умолчанию - Строковая
// const answer = prompt("Whats your name?", "John");
// console.log(answer);

// const answers = [];
// answers[0] = prompt('Whats your name?', "");
// answers[1] = prompt('Whats your surname?', "");
// answers[2] = prompt('How old are you?', "");

// document.write(answers);