// Режим современного кода. 
// Т.е. использование и применение элементов актуальной, современной версии.
//Игноирование предупреждения.
/* jshint -W033 */
"use strict";

// let num = 50;
// WHILE - Пока num меньше 55, выводить значение num и увеличить его на 1.
// while (num < 55) {
//     console.log(num);
//     num++;
// }
// DO-WHILE - Выводи значение num и увеличить его на 1, пока num меньше 55.
// do {
//     console.log(num);
//     num++;
// }
// while (num <= 55);
// FOR - Пока i меньше 8, выполняй эти действия.
// let num = 50;
// for (let i = 1; i < 10; i++) {
//     if (i === 6) {
//         // break;
//         continue;
//     }
//     console.log(i);
// }